# UseLevelOfDetail Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOrShellTessellationControls..::..UseLevelOfDetail Method
SolidOrShellTessellationControls Class See Also
---
Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool UseLevelOfDetail()
```

Visual Basic
---
```text
Public Function UseLevelOfDetail As Boolean
```

Visual C++
---
```text
public:
bool UseLevelOfDetail()
```

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace